EDT/УТ/src/Documents/мгМатериальныйУщерб/мгМатериальныйУщерб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мгМатериальныйУщерб</name>
  <comment>(Миго-групп)</comment>
  <registerRecords>AccumulationRegister.мгЗарплатаУдержания</registerRecords>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Удержание</name>
    <comment>(Миго-групп)</comment>
    <type>
      <types>CatalogRef.мгНачисленияУдержания</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МатериальныйУщерб</name>
    <attributes>
      <name>ФИОСотрудника</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаборТовара</types>
        <types>DocumentRef.Фрахт</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМесяцев</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕжемесячнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Documents/мгМатериальныйУщерб/Forms/ФормаДокументаУпр/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
	КонецЕсли;
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаПриИзменении(Элемент)
	РаботаСДиалогами.ДатаКакМесяцПодобратьДатуПоТексту(МесяцСтрока, Объект.ПериодРегистрации);
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Объект.ПериодРегистрации = ДобавитьМесяц(Объект.ПериодРегистрации, Направление);
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
КонецПроцедуры

&НаКлиенте
Процедура МатериальныйУщербНомерЗаказаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОтбора = Новый Структура("ТерминалДоставки", Объект.Терминал);
	ОткрытьФорму("ОбщаяФорма.мгФормаВыбораЗаказа", ПараметрыОтбора, Элементы.МатериальныйУщерб, Истина,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура МатериальныйУщербОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.МатериальныйУщерб.ТекущиеДанные;
	ТекущиеДанные.Заказ = ВыбранноеЗначение;
	ТекущиеДанные.НомерЗаказа = ВыбранноеЗначение.Номер;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура МатериальныйУщербСуммаПриИзменении(Элемент)
	ЗаполнитьЕжемесячныйПлатеж();
КонецПроцедуры

&НаКлиенте
Процедура МатериальныйУщербКоличествоМесяцевПриИзменении(Элемент)
	ЗаполнитьЕжемесячныйПлатеж();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЕжемесячныйПлатеж()
	ТекущиеДанные = Элементы.МатериальныйУщерб.ТекущиеДанные;
	Попытка
		ТекущиеДанные.ЕжемесячнаяСумма = ТекущиеДанные.Сумма / ТекущиеДанные.КоличествоМесяцев
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки;
	
КонецПроцедуры


&НаКлиенте
Процедура МатериальныйУщербНомерЗаказаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.МатериальныйУщерб.ТекущиеДанные;
	ОткрытьЗначение(ТекущиеДанные.Заказ);
	
КонецПроцедуры


&НаКлиенте
Процедура МатериальныйУщербФИОСотрудникаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.МатериальныйУщерб.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ФИОСотрудника) Тогда
		ДанныеСотрудника = мгДоработки.ПолучитьОрганизациюСотрудника(ТекущиеДанные.ФИОСотрудника);
		Если ДанныеСотрудника.Количество() = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник не принят ни в одну организацию";
			Сообщение.Сообщить();
		ИначеЕсли ДанныеСотрудника.Количество() > 1 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник принят в несколько организаций, необходимо выбрать организацию сотрудника";
			Сообщение.Сообщить();
		Иначе
			ТекущиеДанные.Организация = ДанныеСотрудника[0].Организация;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
	
КонецПроцедуры
